import SignsSection from "@/components/SignsSection";

export default function PrioritySigns() {
  const prioritySigns = [
    {
      title: "Дати дорогу",
      image: "https://res.cloudinary.com/drlr8epdj/image/upload/v1706182516/driving-exams-app/road-signs/uujswn1ueif5n7yisdde.svg",
      description: "Водій повинен дати дорогу транспортним засобам, що під’їжджають до нерегульованого перехрестя по головній дорозі, а за наявності таблички \"Напрямок головної дороги\" - транспортним засобам, що рухаються по головній дорозі. Знак встановлюється безпосередньо перед перехрестям або вузькою ділянкою дороги. Поза населеними пунктами на дорогах з твердим покриттям знак \"Дати дорогу\" повторюється з додатковою табличкою.\n" +
        "\n" +
        "Якщо безпосередньо перед перехрестям встановлено знак \"Проїзд без зупинки заборонено\", йому повинен передувати знак \"Дати дорогу\" з додатковою табличкою \"Відстань до об’єкта\""
    },
    {
      title: "Проїзд без зупинки заборонено",
      image: "https://res.cloudinary.com/drlr8epdj/image/upload/v1706182516/driving-exams-app/road-signs/t9ml0dnddbdqqsppf5bt.svg",
      description: "Забороняється проїзд без зупинки перед стоп-лінією, а у разі, коли вона відсутня, перед знаком. Необхідно дати дорогу транспортним засобам, що рухаються дорогою, яка перетинається, а за наявності таблички \"Напрямок головної дороги\" - транспортним засобам, що рухаються головною дорогою, а також праворуч рівнозначною дорогою. Знак встановлюється безпосередньо перед перехрестям або вузькою ділянкою дороги.\n" +
        "\n" +
        "Якщо безпосередньо перед перехрестям встановлено знак \"Проїзд без зупинки заборонено\", йому повинен передувати знак \"Дати дорогу\" з додатковою табличкою \"Відстань до об’єкта\".\n" +
        "\n" +
        "Якщо знак \"Проїзд без зупинки заборонено\" встановлений перед залізничним переїздом, що не охороняється та не обладнаний світлофорною сигналізацією, водій повинен зупинитися перед стоп-лінією, а за її відсутності - перед цим знаком"
    },
    {
      title: "Головна дорога",
      image: "https://res.cloudinary.com/drlr8epdj/image/upload/v1706182516/driving-exams-app/road-signs/sdinnhmgbz9gwaatjbla.svg",
      description: "Надається право першочергового проїзду нерегульованих перехресть. Знак встановлюється перед перехрестям або вузькою ділянкою дороги, а також на початку головної дороги. Знак \"Головна дорога\" з табличкою \"Напрямок головної дороги\" обов’язково повторюється перед перехрестям, на якому головна дорога змінює свій напрямок"
    },
    {
      title: "Кінець головної дороги",
      image: "https://res.cloudinary.com/drlr8epdj/image/upload/v1706182516/driving-exams-app/road-signs/nxfnhhpwvknopqff2bez.svg",
      description: "Скасовується право першочергового проїзду нерегульованих перехресть. Знак встановлюється в кінці головної дороги"
    },
    {
      title: "Перевага зустрічного руху",
      image: "https://res.cloudinary.com/drlr8epdj/image/upload/v1706182516/driving-exams-app/road-signs/psabo7smsfj2dvpt9scj.svg",
      description: "Забороняється в’їзд на вузьку ділянку дороги, якщо це може утруднити зустрічний рух. Водій повинен дати дорогу зустрічним транспортним засобам, що розташовані на вузькій ділянці. Знак встановлюється безпосередньо перед перехрестям або вузькою ділянкою дороги"
    },
    {
      title: "Перевага перед зустрічним рухом",
      image: "https://res.cloudinary.com/drlr8epdj/image/upload/v1706182516/driving-exams-app/road-signs/ofenyka2uiyklhqzci69.svg",
      description: "Вузька ділянка дороги, під час руху якою водій має перевагу стосовно зустрічних транспортних засобів. Знак встановлюється безпосередньо перед перехрестям або вузькою ділянкою дороги"
    }
  ];

  return (
    <SignsSection signsList={prioritySigns} />
  )
}
